RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_mjpeg.c
    /*align buffer to 16 bytes boundary*/
    BL_WR_REG(MJPEG_BASE, MJPEG_JPEG_FRAME_ADDR, (cfg->bufferMjpeg & 0xFFFFFFF0));

    /*Set memory brust size */
    if (cfg->burst == MJPEG_BURST_SINGLE) {
        BL_WR_REG(MJPEG_BASE, MJPEG_JPEG_STORE_MEMORY, cfg->sizeMjpeg / 8);
    } else if (cfg->burst == MJPEG_BURST_INCR4) {
        BL_WR_REG(MJPEG_BASE, MJPEG_JPEG_STORE_MEMORY, cfg->sizeMjpeg / 32);
    } else if (cfg->burst == MJPEG_BURST_INCR8) {
        BL_WR_REG(MJPEG_BASE, MJPEG_JPEG_STORE_MEMORY, cfg->sizeMjpeg / 64);
    } else if (cfg->burst == MJPEG_BURST_INCR16) {
        BL_WR_REG(MJPEG_BASE, MJPEG_JPEG_STORE_MEMORY, cfg->sizeMjpeg / 128);
    }

    /* Clear interrupt */
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x3F00);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(MJPEG_IRQn, MJPEG_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  Mjpeg set YUYV order, only work in interleave mode
 *
 * @param  y0: Y0 order
 * @param  u0: U0 order
 * @param  y1: Y1 order
 * @param  v0: V0 order
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Set_YUYV_Order_Interleave(uint8_t y0, uint8_t u0, uint8_t y1, uint8_t v0)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_HEADER_BYTE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_Y0_ORDER, y0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_U0_ORDER, u0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_Y1_ORDER, y1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_V0_ORDER, v0);
    BL_WR_REG(MJPEG_BASE, MJPEG_HEADER_BYTE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Mjpeg set Y/UV input cam id, only work in planar mode
 *
 * @param  yCamId: Cam id of Y used
 * @param  uvCamId: Cam id of UV used
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Set_Planar_Y_UV_Input(uint8_t yCamId, uint8_t uvCamId)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_YY_DVP2AXI_SEL, yCamId);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_UV_DVP2AXI_SEL, uvCamId);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Deinit mjpeg module
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Deinit(void)
{
    GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_MJPEG);
}

/****************************************************************************/ /**
 * @brief  Enable mjpeg module
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Enable(void)
{
    uint32_t tmpVal;

    /* Enable mjpeg module */
    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_1);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_MJPEG_ENABLE);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Disable mjpeg module
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Disable(void)
{
    uint32_t tmpVal;

    /* Disable mjpeg module */
    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_1);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_MJPEG_ENABLE);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Enable&disable mjpeg software mode and set frame count
 *
 * @param  swType: SW mode type
 * @param  count: Frame count
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_SW_Enable(MJPEG_SW_Mode_Type swType, uint8_t count)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_SW_FRAME, count);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_SW_KICK_MODE, swType);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_MODE);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_MODE);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
}

/****************************************************************************/ /**
 * @brief  MJPEG software mode run, software mode enable first
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_SW_Run(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_2);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_RUN);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_RUN);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Set memory to store block line for frame on SW kick
 *
 * @param  count: Block line count
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_SW_Set_Kick_Block(uint16_t count)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_YUV_MEM_SW);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_SW_KICK_HBLK, count);
    BL_WR_REG(MJPEG_BASE, MJPEG_YUV_MEM_SW, tmpVal);
}

/****************************************************************************/ /**
 * @brief  MJPEG SW mode kick once
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_SW_Kick(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_2);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_SW_KICK);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get one mjpeg frame
 *
 * @param  info: Mjpeg frame infomation pointer
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Get_Frame_Info(MJPEG_Frame_Info *info)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3);

    info->validFrames = BL_GET_REG_BITS_VAL(tmpVal, MJPEG_FRAME_VALID_CNT);
    info->curFrameId = BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_FRAME_ID_10), MJPEG_FRAME_ID_0);
    info->curFrameAddr = BL_RD_REG(MJPEG_BASE, MJPEG_START_ADDR0);
    info->curFrameBytes = (BL_RD_REG(MJPEG_BASE, MJPEG_BIT_CNT0) + 7) >> 3;
    info->status = tmpVal;
}

/****************************************************************************/ /**
 * @brief  Get available count of frames
 *
 * @param  None
 *
 * @return Frames count
 *
*******************************************************************************/
uint8_t MJPEG_Get_Frame_Count(void)
{
    return BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3), MJPEG_FRAME_VALID_CNT);
}

/****************************************************************************/ /**
 * @brief  Pop one mjpeg frame
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Pop_Frame(void)
{
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 1);
}

/****************************************************************************/ /**
 * @brief  Free current read memory block
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Current_Block_Clear(void)
{
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x2);
}

/****************************************************************************/ /**
 * @brief  Current read memory block index
 *
 * @param  None
 *
 * @return Block number
 *
*******************************************************************************/
MJPEG_Swap_Block_Type MJPEG_Get_Current_Block(void)
{
    return (MJPEG_Swap_Block_Type)BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_READ_SWAP_IDX);
}

/****************************************************************************/ /**
 * @brief  Get block status, full or not full
 *
 * @param  block: Block number
 *
 * @return Block status
 *
*******************************************************************************/
BL_Sts_Type MJPEG_Block_Is_Full(MJPEG_Swap_Block_Type block)
{
    CHECK_PARAM(IS_MJPEG_SWAP_BLOCK_TYPE(block));

    if (MJPEG_BLOCK_0 == block) {
        return (BL_Sts_Type)BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP0_FULL);
    } else {
        return (BL_Sts_Type)BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP1_FULL);
    }
}

/****************************************************************************/ /**
 * @brief  Current read memory block is frame start
 *
 * @param  None
 *
 * @return Set or reset
 *
*******************************************************************************/
BL_Sts_Type MJPEG_Current_Block_Is_Start(void)
{
    return (BL_Sts_Type)BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP_FSTART);
}

/****************************************************************************/ /**
 * @brief  Current read memory block is frame end
 *
 * @param  None
 *
 * @return Set or reset
 *
*******************************************************************************/
BL_Sts_Type MJPEG_Current_Block_Is_End(void)
{
    return (BL_Sts_Type)BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP_FEND);
}

/****************************************************************************/ /**
 * @brief  Get frame remain bit count in last block, only valid when current read memory block is
 *         frame end
 *
 * @param  None
 *
 * @return Bit count
 *
*******************************************************************************/
uint32_t MJPEG_Get_Remain_Bit(void)
{
    return BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_BIT_CNT);
}

/****************************************************************************/ /**
 * @brief  Set frame threshold to issue normal interrupt
 *
 * @param  count: Frame threshold
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Set_Frame_Threshold(uint8_t count)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_FRAME_CNT_TRGR_INT, count);
    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_3, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Set bytes of frame head to preserve
 *
 * @param  size: Bytes of head
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Frame_Head_Set_Size(uint16_t size)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_HEADER_BYTE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_HEAD_BYTE, size);
    BL_WR_REG(MJPEG_BASE, MJPEG_HEADER_BYTE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Enable or disable auto fill frame tail with 0xff and 0xd9
 *
 * @param  enable: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Frame_Tail_Auto_Fill(BL_Fun_Type enable)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_HEADER_BYTE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_TAIL_EXP, enable);
    BL_WR_REG(MJPEG_BASE, MJPEG_HEADER_BYTE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Set parameter in Y quantize table according to index
 *
 * @param  index: Q parameter index
 * @param  qParameter: Q parameter value
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Set_Quantize_Parameter_Y(uint8_t index, uint16_t qParameter)
{
    uint32_t tmpVal;

    if (index > 63) {
        return;
    }

    index = index % 8 * 8 + index / 8;

