RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_mjpeg.c
    tmpVal = 2048 / qParameter;

    if (20480 / qParameter % 10 > 4) {
        tmpVal++;
    }

    qParameter = tmpVal & 0xffff;

    tmpVal = BL_RD_WORD(MJPEG_BASE + MJPEG_Q_PARAM_00_OFFSET + (index >> 1) * 4);
    BL_WR_WORD(MJPEG_BASE + MJPEG_Q_PARAM_00_OFFSET + (index >> 1) * 4, (tmpVal & 0xffff0000 >> 16 * (index % 2)) | qParameter << 16 * (index % 2));
}

/****************************************************************************/ /**
 * @brief  Set parameter in UV quantize table according to index
 *
 * @param  index: Q parameter index
 * @param  qParameter: Q parameter value
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Set_Quantize_Parameter_UV(uint8_t index, uint16_t qParameter)
{
    uint32_t tmpVal;

    if (index > 63) {
        return;
    }

    index = index % 8 * 8 + index / 8;

    tmpVal = 2048 / qParameter;

    if (20480 / qParameter % 10 > 4) {
        tmpVal++;
    }

    qParameter = tmpVal & 0xffff;

    tmpVal = BL_RD_WORD(MJPEG_BASE + MJPEG_Q_PARAM_40_OFFSET + (index >> 1) * 4);
    BL_WR_WORD(MJPEG_BASE + MJPEG_Q_PARAM_40_OFFSET + (index >> 1) * 4, (tmpVal & 0xffff0000 >> 16 * (index % 2)) | qParameter << 16 * (index % 2));
}

/****************************************************************************/ /**
 * @brief  Set Y quantize table
 *
 * @param  qTable: Y table
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Set_Quantize_Table_Y(uint16_t *qTable)
{
    uint8_t i, j;
    uint16_t tmpVal1;
    uint16_t tmpVal2;

    for (i = 0; i < 8; i++) {
        for (j = 0; j < 4; j++) {
            tmpVal1 = 2048 / qTable[16 * j + i];
            tmpVal2 = 2048 / qTable[16 * j + i + 8];

            if (20480 / qTable[16 * j + i] % 10 > 4) {
                tmpVal1++;
            }

            if (20480 / qTable[16 * j + i + 8] % 10 > 4) {
                tmpVal2++;
            }

            BL_WR_WORD(MJPEG_BASE + MJPEG_Q_PARAM_00_OFFSET + (i * 4 + j) * 4, tmpVal1 | tmpVal2 << 16);
        }
    }
}

/****************************************************************************/ /**
 * @brief  Set UV quantize table
 *
 * @param  qTable: UV table
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Set_Quantize_Table_UV(uint16_t *qTable)
{
    uint8_t i, j;
    uint16_t tmpVal1;
    uint16_t tmpVal2;

    for (i = 0; i < 8; i++) {
        for (j = 0; j < 4; j++) {
            tmpVal1 = 2048 / qTable[16 * j + i];
            tmpVal2 = 2048 / qTable[16 * j + i + 8];

            if (20480 / qTable[16 * j + i] % 10 > 4) {
                tmpVal1++;
            }

            if (20480 / qTable[16 * j + i + 8] % 10 > 4) {
                tmpVal2++;
            }

            BL_WR_WORD(MJPEG_BASE + MJPEG_Q_PARAM_40_OFFSET + (i * 4 + j) * 4, tmpVal1 | tmpVal2 << 16);
        }
    }
}

/****************************************************************************/ /**
 * @brief  Calculate quantize table according to input table and quality factor
 *
 * @param  inputTable: Pointer of input table
 * @param  outputTable: Pointer of output table
 * @param  quality: Quality factor
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Calculate_Quantize_Table(uint16_t *inputTable, uint16_t *outputTable, uint8_t quality)
{
    uint32_t scaleFactor, i;

    if (quality == 0) {
        quality = 1;
    } else if (quality > 100) {
        quality = 100;
    }

    if (quality < 50) {
        scaleFactor = 5000000 / quality;
    } else {
        scaleFactor = 200000 - quality * 2000;
    }

    for (i = 0; i < 64; i++) {
        outputTable[i] = (inputTable[i] * scaleFactor + 50000) / 100000;

        if (outputTable[i] == 0) {
            outputTable[i] = 1;
        } else if (outputTable[i] > 0xff) {
            outputTable[i] = 0xff;
        }
    }
}

/****************************************************************************/ /**
 * @brief  Quantize SRAM switch
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_Quantize_SRAM_Switch(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_Q_ENC);
    tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_Q_SRAM_SW);
    BL_WR_REG(MJPEG_BASE, MJPEG_Q_ENC, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get current quantize SRAM selection for encode
 *
 * @param  None
 *
 * @return Current quantize SRAM
 *
*******************************************************************************/
uint8_t MJPEG_Get_Current_Quantize_SRAM(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_Q_ENC);
    return BL_GET_REG_BITS_VAL(tmpVal, MJPEG_STS_Q_SRAM_ENC);
}

/****************************************************************************/ /**
 * @brief  Get frame0~3 quantize SRAM selection
 *
 * @param  frameId: Frame id
 *
 * @return Quantize SRAM
 *
*******************************************************************************/
uint8_t MJPEG_Get_Frame_Quantize_SRAM(MJPEG_Frame_ID_Type frameId)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_Q_ENC);
    return (tmpVal >> frameId & 1);
}

/****************************************************************************/ /**
 * @brief  MJPEG Enable Disable Interrupt
 *
 * @param  intType: MJPEG Interrupt Type
 * @param  intMask: Enable or Disable
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_IntMask(MJPEG_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_MJPEG_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3);

    switch (intType) {
        case MJPEG_INT_NORMAL:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_NORMAL_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_NORMAL_EN);
            }

            break;

        case MJPEG_INT_CAM_OVERWRITE:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_CAM_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_CAM_EN);
            }

            break;

