RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_mjpeg.c
        case MJPEG_INT_MEM_OVERWRITE:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_MEM_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_MEM_EN);
            }

            break;

        case MJPEG_INT_FRAME_OVERWRITE:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_FRAME_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_FRAME_EN);
            }

            break;

        case MJPEG_INT_BACK_IDLE:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_IDLE_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_IDLE_EN);
            }

            break;

        case MJPEG_INT_SWAP:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_SWAP_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_SWAP_EN);
            }

            break;

        case MJPEG_INT_ALL:
            if (intMask == UNMASK) {
                /* Enable all interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_NORMAL_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_CAM_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_MEM_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_FRAME_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_IDLE_EN);
                tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_SWAP_EN);
            } else {
                /* Disable all interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_NORMAL_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_CAM_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_MEM_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_FRAME_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_IDLE_EN);
                tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_SWAP_EN);
            }

            break;

        default:
            break;
    }

    BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_3, tmpVal);
}

/****************************************************************************/ /**
 * @brief  MJPEG Interrupt Clear
 *
 * @param  intType: MJPEG Interrupt Type
 *
 * @return None
 *
*******************************************************************************/
void MJPEG_IntClr(MJPEG_INT_Type intType)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_MJPEG_INT_TYPE(intType));

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP);

    switch (intType) {
        case MJPEG_INT_NORMAL:
            tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_NORMAL_CLR);
            break;

        case MJPEG_INT_CAM_OVERWRITE:
            tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_CAM_CLR);
            break;

        case MJPEG_INT_MEM_OVERWRITE:
            tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_MEM_CLR);
            break;

        case MJPEG_INT_FRAME_OVERWRITE:
            tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_FRAME_CLR);
            break;

        case MJPEG_INT_BACK_IDLE:
            tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_IDLE_CLR);
            break;

        case MJPEG_INT_SWAP:
            tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_SWAP_CLR);
            break;

        case MJPEG_INT_ALL:
            tmpVal = 0x3F00;

        default:
            break;
    }

    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Install mjpeg interrupt callback function
 *
 * @param  intType: MJPEG interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void MJPEG_Int_Callback_Install(MJPEG_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_MJPEG_INT_TYPE(intType));

    mjpegIntCbfArra[intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  Mjpeg interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void MJPEG_IRQHandler(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3);

    if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_NORMAL_INT)) {
        BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x100);

        if (mjpegIntCbfArra[MJPEG_INT_NORMAL] != NULL) {
            /* call the callback function */
            mjpegIntCbfArra[MJPEG_INT_NORMAL]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_CAM_INT)) {
        BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x200);

        if (mjpegIntCbfArra[MJPEG_INT_CAM_OVERWRITE] != NULL) {
            /* call the callback function */
            mjpegIntCbfArra[MJPEG_INT_CAM_OVERWRITE]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_MEM_INT)) {
        BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x400);

        if (mjpegIntCbfArra[MJPEG_INT_MEM_OVERWRITE] != NULL) {
            /* call the callback function */
            mjpegIntCbfArra[MJPEG_INT_MEM_OVERWRITE]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_FRAME_INT)) {
        BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x800);

        if (mjpegIntCbfArra[MJPEG_INT_FRAME_OVERWRITE] != NULL) {
            /* call the callback function */
            mjpegIntCbfArra[MJPEG_INT_FRAME_OVERWRITE]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_IDLE_INT)) {
        BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x1000);

        if (mjpegIntCbfArra[MJPEG_INT_BACK_IDLE] != NULL) {
            /* call the callback function */
            mjpegIntCbfArra[MJPEG_INT_BACK_IDLE]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_SWAP_INT)) {
        BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x2000);

        if (mjpegIntCbfArra[MJPEG_INT_SWAP] != NULL) {
            /* call the callback function */
            mjpegIntCbfArra[MJPEG_INT_SWAP]();
        }
    }
}
#endif

/*@} end of group MJPEG_Public_Functions */

/*@} end of group MJPEG */

/*@} end of group BL808_Peripheral_Driver */
